# SunAndShadowSettings Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SunAndShadowSettings Properties
SunAndShadowSettings Class See Also
---
The SunAndShadowSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ActiveFrame | Identifies the active animation frame for a single-day or multi-day study, starting at 1.0 for the first frame and incrementing in intervals of 1.0. |
| ActiveFrameTime | Identifies the date and time of the SunAndShadowSettings element for the active frame. |
| Altitude | Altitude setting (angle in radians). This is only relevant when dealing with a SunAndShadowSettings element that uses lighting mode. |
| AssemblyInstanceId | The id of the assembly instance to which the element belongs.  (Inherited from Element.) |
| Azimuth | Azimuth setting (angle in radians). This is only relevant when dealing with a SunAndShadowSettings element that uses lighting mode. |
| BoundingBox | Retrieves a box that circumscribes all geometry of the element. (Inherited from Element.) |
| Category | Retrieves a Category object that represents the category or sub category in which the element resides. (Inherited from Element.) |
| CreatedPhaseId | Id of a Phase at which the Element was created.  (Inherited from Element.) |
| DemolishedPhaseId | Id of a Phase at which the Element was demolished.  (Inherited from Element.) |
| DesignOption | Returns the design option to which the element belongs. (Inherited from Element.) |
| Document | Returns the Document in which the Element resides. (Inherited from Element.) |
| EndDateAndTime | Identifies the end date and time. |
| Geometry | Retrieves the geometric representation of the element. (Inherited from Element.) |
| GroundPlaneHeight | Identifies the ground plane height. |
| GroundPlaneLevelId | Identifies the element id of the Ground Plane level for the SunAndShadowSettings element. |
| GroupId | The id of the group to which an element belongs.  (Inherited from Element.) |
| Id | A unique identifier for an Element in an Autodesk Revit project.  (Inherited from Element.) |
| IsModifiable | Identifies if the element is modifiable.  (Inherited from Element.) |
| IsTransient | Indicates whether an element is transient or permanent.  (Inherited from Element.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from Element.) |
| Latitude | Identifies the current latitude used by the SunAndShadowSettings element. |
| LevelId | The id of the level associated with the element.  (Inherited from Element.) |
| Location | This property is used to find the physical location of an element within a project. (Inherited from Element.) |
| Longitude | Identifies the current longitude used by the SunAndShadowSettings element. |
| Name | A human readable name for the Element. (Inherited from Element.) |
| NumberOfFrames | Identifies the total number of animation frames for a single-day or multi-day study. |
| OwnerViewId | The id of the view that owns the element.  (Inherited from Element.) |
| [Parameter[([( Guid])]) ](2e852bc4-46c6-5598-cc45-0eaf38cf8973.md "Parameter Property \(Guid\)") | Retrieves a parameter from the element given a GUID for a shared parameter. (Inherited from Element.) |
| [Parameter[([( BuiltInParameter])]) ](2f91a9f3-7f69-72f9-08d6-a2d71dfb33db.md "Parameter Property \(BuiltInParameter\)") | Retrieves a parameter from the element given a parameter id. (Inherited from Element.) |
| [Parameter[([( Definition])]) ](87d8a88c-906e-85a9-f575-f263788b8584.md "Parameter Property \(Definition\)") | Retrieves a parameter from the element based on its definition. (Inherited from Element.) |
| Parameters | Retrieves a set containing all of the parameters that are contained within the element. (Inherited from Element.) |
| ParametersMap | Retrieves a map containing all of the parameters that are contained within the element. (Inherited from Element.) |
| Pinned | Identifies if the element has been pinned to prevent changes.  (Inherited from Element.) |
| ProjectLocationId | Identifies the ProjectLocation element used by the SunAndShadowSettings element. |
| ProjectLocationName | Identifies the name of the project location used by the SunAndShadowSettings element. |
| RelativeToView | Identifies whether the SunAndShadowSettings element is relative to the view direction. This is only relevant for lighting mode. |
| SharesSettings | Identifies whether settings are shared globally. |
| StartDateAndTime | Identifies the start or current date and time. |
| SunAndShadowType | Identifies the type of the SunAndShadowSettings element. |
| SunriseToSunset | Identifies whether the current single day sun study is set to run from sunrise to sunset. |
| TimeInterval | Identifies the time interval between animation frames. |
| TimeZone | Identifies the time zone. |
| UniqueId | A stable unique identifier for an element within the document.  (Inherited from Element.) |
| UsesDST | Identifies whether the SunAndShadowSettings element is using daylight savings time. |
| UsesGroundPlane | Identifies whether the SunAndShadowSettings element uses a ground plane. |
| VersionGuid | Get the element version Guid.  (Inherited from Element.) |
| ViewSpecific | Identifies if the element is owned by a view.  (Inherited from Element.) |
| Visible | Visibility in current view for a per-view SunAndShadowSettings element. |
| WorksetId | Get Id of the Workset which owns the element.  (Inherited from Element.) |

# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace